#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.service_records["api"].data.util_replace.record_names["$nameA$addressvegan.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_names["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"]: Reading...
module.service_records["api"].data.util_replace.record_names["$name.internalA$node_addressvegan.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_names["$name.internalA$node_addressmeatlover.pizza"]: Reading...
module.service_records["web_1"].data.util_replace.record_names["web.devA127.0.0.1vegan.pizza"]: Reading...
module.service_records["web_2"].data.util_replace.record_names["$nameSRV10 10 $port $name.$node_datacenter.vegan.pizzavegan.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_names["mailMX$name.internal.vegan.pizzameatlover.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_names["mailMX$name.internal.vegan.pizzameatlover.pizza"]: Read complete after 0s [id=1361488968]
module.service_records["web_3"].data.util_replace.record_names["$name.internal-secondaryA$addressmeatlover.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_contents["mailMX$name.internal.vegan.pizzameatlover.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_contents["mailMX$name.internal.vegan.pizzameatlover.pizza"]: Read complete after 0s [id=2233865113]
module.service_records["web_3"].data.util_replace.record_contents["$name.internal-secondaryA$addressmeatlover.pizza"]: Reading...
module.service_records["api"].data.util_replace.record_names["$name.internalA$node_addressvegan.pizza"]: Read complete after 0s [id=1058013210]
module.service_records["web_1"].data.util_replace.record_names["web.devA127.0.0.1vegan.pizza"]: Read complete after 0s [id=2713156357]
module.service_records["web_3"].data.util_replace.record_names["$name.internalA$node_addressmeatlover.pizza"]: Read complete after 0s [id=4218739576]
module.service_records["web_3"].data.util_replace.record_contents["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"]: Reading...
module.service_records["api"].data.util_replace.record_names["$nameA$addressvegan.pizza"]: Read complete after 0s [id=2902841359]
module.service_records["web_2"].data.util_replace.record_contents["$nameSRV10 10 $port $name.$node_datacenter.vegan.pizzavegan.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_contents["$name.internalA$node_addressmeatlover.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_names["$name.internal-secondaryA$addressmeatlover.pizza"]: Read complete after 0s [id=2581359468]
module.service_records["web_2"].data.util_replace.record_names["$nameSRV10 10 $port $name.$node_datacenter.vegan.pizzavegan.pizza"]: Read complete after 0s [id=365508689]
module.service_records["api"].data.util_replace.record_contents["$nameA$addressvegan.pizza"]: Reading...
module.service_records["web_3"].data.util_replace.record_contents["$name.internal-secondaryA$addressmeatlover.pizza"]: Read complete after 0s [id=2063064979]
module.service_records["web_3"].data.util_replace.record_names["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"]: Read complete after 0s [id=365508689]
module.service_records["web_3"].data.util_replace.record_contents["$name.internalA$node_addressmeatlover.pizza"]: Read complete after 0s [id=1752284142]
module.service_records["web_3"].data.util_replace.record_contents["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"]: Read complete after 0s [id=3747861457]
module.service_records["web_2"].data.util_replace.record_contents["$nameSRV10 10 $port $name.$node_datacenter.vegan.pizzavegan.pizza"]: Read complete after 0s [id=129033475]
module.service_records["api"].data.util_replace.record_contents["$nameA$addressvegan.pizza"]: Read complete after 0s [id=2499395263]
module.service_records["api"].data.util_replace.record_contents["$name.internalA$node_addressvegan.pizza"]: Reading...
module.service_records["web_1"].data.util_replace.record_contents["web.devA127.0.0.1vegan.pizza"]: Reading...
module.service_records["api"].data.util_replace.record_contents["$name.internalA$node_addressvegan.pizza"]: Read complete after 0s [id=527862648]
module.service_records["web_1"].data.util_replace.record_contents["web.devA127.0.0.1vegan.pizza"]: Read complete after 0s [id=3619153832]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service_records["api"].dnsimple_zone_record.consul_service_records["$name.internalA$node_addressvegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "api.internal"
      + name_normalized  = (known after apply)
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 1800
      + type             = "A"
      + value            = "192.168.10.10"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "vegan.pizza"
    }

  # module.service_records["api"].dnsimple_zone_record.consul_service_records["$nameA$addressvegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "api"
      + name_normalized  = (known after apply)
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 1800
      + type             = "A"
      + value            = "172.17.0.1"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "vegan.pizza"
    }

  # module.service_records["web_1"].dnsimple_zone_record.consul_service_records["web.devA127.0.0.1vegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "web.dev"
      + name_normalized  = (known after apply)
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 60
      + type             = "A"
      + value            = "127.0.0.1"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "vegan.pizza"
    }

  # module.service_records["web_2"].dnsimple_zone_record.consul_service_records["$nameSRV10 10 $port $name.$node_datacenter.vegan.pizzavegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "web"
      + name_normalized  = (known after apply)
      + priority         = 10
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "SRV"
      + value            = "10 10 5000 web.dc1.vegan.pizza"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "vegan.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$name.internal-secondaryA$addressmeatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "web.internal-secondary"
      + name_normalized  = (known after apply)
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "A"
      + value            = "172.17.0.3"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "meatlover.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$name.internalA$node_addressmeatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "web.internal"
      + name_normalized  = (known after apply)
      + priority         = (known after apply)
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "A"
      + value            = "192.168.10.11"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "meatlover.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["$nameSRV10 $port $name.internal.vegan.pizzavegan.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "web"
      + name_normalized  = (known after apply)
      + priority         = 10
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "SRV"
      + value            = "10 5000 web.internal.vegan.pizza"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "vegan.pizza"
    }

  # module.service_records["web_3"].dnsimple_zone_record.consul_service_records["mailMX$name.internal.vegan.pizzameatlover.pizza"] will be created
  + resource "dnsimple_zone_record" "consul_service_records" {
      + id               = (known after apply)
      + name             = "mail"
      + name_normalized  = (known after apply)
      + priority         = 10
      + qualified_name   = (known after apply)
      + ttl              = 3600
      + type             = "MX"
      + value            = "web.internal.vegan.pizza"
      + value_normalized = (known after apply)
      + zone_id          = (known after apply)
      + zone_name        = "meatlover.pizza"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_records = {
      + api   = {
          + defaults           = {
              + record_ttl  = 1800
              + record_type = "A"
              + zone_name   = "vegan.pizza"
            }
          + service_record_map = [
              + "vegan.pizza:api.internal:A:1800:192.168.10.10",
              + "vegan.pizza:api:A:1800:172.17.0.1",
            ]
        }
      + web_1 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = null
            }
          + service_record_map = [
              + "vegan.pizza:web.dev:A:60:127.0.0.1",
            ]
        }
      + web_2 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = null
            }
          + service_record_map = [
              + "vegan.pizza:web:SRV:3600:10 10 5000 web.dc1.vegan.pizza",
            ]
        }
      + web_3 = {
          + defaults           = {
              + record_ttl  = 3600
              + record_type = "A"
              + zone_name   = "meatlover.pizza"
            }
          + service_record_map = [
              + "meatlover.pizza:web.internal-secondary:A:3600:172.17.0.3",
              + "meatlover.pizza:web.internal:A:3600:192.168.10.11",
              + "vegan.pizza:web:SRV:3600:10 5000 web.internal.vegan.pizza",
              + "meatlover.pizza:mail:MX:3600:web.internal.vegan.pizza",
            ]
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @AGS4NO, Action: `pull_request`*